Documents/Списание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Списание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
				<xr:Item>AccumulationRegister.Партии</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Списание/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиТоваров.Очистить();
	
	//Остатки
	Для каждого СтрокаТоваров Из Товары Цикл
		НовоеДвижение = Движения.ОстаткиТоваров.Добавить();
		НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Товар = СтрокаТоваров.Товар;
		НовоеДвижение.Склад = Склад;
		НовоеДвижение.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	
	//Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиТоваров.Записать();
	
	//Движения.Записать();
	
	//Контроль остатков
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Списание.НомерСтроки,
	               |	Списание.Товар КАК Товар,
	               |	Списание.Количество
	               |ПОМЕСТИТЬ ВТСписание
	               |ИЗ
	               |	Документ.Списание.Товары КАК Списание
	               |ГДЕ
	               |	Списание.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Товар
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиТоваров.Товар,
	               |	ОстаткиТоваров.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваров.Остатки(
	               |				&Период,
	               |				Склад = &Склад
				   |					И Товар В
				   |						(ВЫБРАТЬ
				   |							ВТСписание.Товар
				   |						ИЗ
				   |							ВТСписание)
	               |) КАК ОстаткиТоваров
	               |ГДЕ ОстаткиТоваров.КоличествоОстаток < 0";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			//Сообщить(СтрШаблон("На складе %1 нехватает остатка товара %2 (имеется %3, необходимо %4)", Склад, Выборка.Товар, Выборка.КоличествоОстаток, Выборка.Количество));
			Сообщить("На складе " + Склад + " нехватает остатка товара " + Выборка.Товар + " (нехватило " + Выборка.КоличествоОстаток + ")");
			Отказ = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
